Catalogs/ОблачныеПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОблачныеПриложения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОблачныхПриложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОблачныеПриложения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Конструктор сведений об облачном приложении.
//
// Возвращаемое значение:
//   Структура
//
Функция НовыйДанныеПриложения() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Ссылка", Неопределено);
	Результат.Вставить("Адрес", "");
	Результат.Вставить("Вид", Неопределено);
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("Наименование", "");
	
	Возврат Результат;
	
КонецФункции

// Получает облачное приложение по его идентификатору.
//
// Параметры:
//   Идентификатор - Строка - идентификатор облачного приложения
//
// Возвращаемое значение:
//   СправочникСсылка.ОблачныеПриложения - ссылка на облачное приложение,
//   Неопределено - если приложение по указанному идентификатору не найдено
//
Функция Получить(Идентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОблачныеПриложения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОблачныеПриложения КАК ОблачныеПриложения
	|ГДЕ
	|	ОблачныеПриложения.Код = &Идентификатор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОблачныеПриложения.Ссылка";
	
	Запрос.Параметры.Вставить("Идентификатор", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Возвращает данные облачного приложения.
//
// Параметры:
//   Приложение - СправочникСсылка.ОблачныеПриложения - ссылка на облачное приложение
//
// Возвращаемое значение:
//   Структура - см. НовыйДанныеПриложения()
//   Неопределено - если передана битая ссылка
//
Функция ДанныеПриложения(Приложение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОблачныеПриложения.Ссылка КАК Ссылка,
	|	ОблачныеПриложения.Адрес КАК Адрес,
	|	ОблачныеПриложения.Вид КАК Вид,
	|	ОблачныеПриложения.Код КАК Идентификатор,
	|	ОблачныеПриложения.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ОблачныеПриложения КАК ОблачныеПриложения
	|ГДЕ
	|	ОблачныеПриложения.Ссылка = &Приложение";
	
	Запрос.Параметры.Вставить("Приложение", Приложение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = НовыйДанныеПриложения();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		Возврат Результат;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Возвращает экземпляр облачного приложения по идентификатору. Создает отсутствующий экземпляр.
// Если экземпляр существует, и у него не заполнено Наименование, то Наименование
// заполняется из параметров.
//
// Параметры:
//   Идентификатор - Строка - идентификатор облачного приложения
//   Адрес - Строка - URI приложения
//   Наименование - Строка - наименование облачного приложения в облаке
//   Вид - Перечисление.ВидыОблачныхПриложений - вид облачного приложения
//   НаименованиеВида - наименование вида приложения,
//                      например: Бухгалтерия КОРП, 1С:БизнесСтарт
//
// Возвращаемое значение:
//   СправочникСсылка.ОблачныеПриложения - ссылка на экземпляр облачного приложения
//   Неопределено - если передан пустой идентификатор приложения
//
Функция СсылкаПриложение(Идентификатор, Адрес = "", Наименование = "", Вид = Неопределено, НаименованиеВида = "") Экспорт
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Приложение = Получить(Идентификатор);
	Если Приложение <> Неопределено Тогда
		Возврат Приложение;
	КонецЕсли;
	
	Попытка
		НачатьТранзакцию();
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ОблачныеПриложения");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		// Ответственное чтение.
		Приложение = Получить(Идентификатор);
		Если Приложение <> Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат Приложение;
		КонецЕсли;
		
		НовоеПриложение = Справочники.ОблачныеПриложения.СоздатьЭлемент();
		НовоеПриложение.Наименование = Наименование;
		НовоеПриложение.Код = Идентификатор;
		НовоеПриложение.Адрес = Адрес;
		НовоеПриложение.Вид = Вид;
		НовоеПриложение.НаименованиеВида = НаименованиеВида;
		
		Если Не ЗначениеЗаполнено(НовоеПриложение.Наименование) Тогда
			НовоеПриложение.Наименование = Идентификатор;
		КонецЕсли;
		
		НовоеПриложение.Записать();
		ЗафиксироватьТранзакцию();
		
		Возврат НовоеПриложение.Ссылка;
	Исключение
		
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Облачные приложения'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ВызватьИсключение;
	КонецПопытки;
КонецФункции

// Переименовывает существующий экземпляр облачного приложения
//
// Параметры:
//   Приложение - СправочникСсылка.ОблачныеПриложения - ссылка на облачное приложение
//   Наименование - Строка - наименование облачного приложения в облаке
//
Процедура Переименовать(Приложение, Наименование) Экспорт
	
	ПриложениеОбъект = Приложение.ПолучитьОбъект();
	ПриложениеОбъект.Наименование = Наименование;
	ПриложениеОбъект.Записать();
	
КонецПроцедуры

// Устанавливает вид и наименование вида существующему экземпляру облачного приложения
//
// Параметры:
//   Приложение - СправочникСсылка.ОблачныеПриложения - ссылка на облачное приложение
//   Вид - Перечисление.ВидыОблачныхПриложений - вид облачного приложения
//   НаименованиеВида - Строка - наименование вида облачного приложения,
//                               например: Бухгалтерия КОРП, 1С:БизнесСтарт
//
Процедура УстановитьВид(Приложение, Вид, НаименованиеВида) Экспорт
	
	ПриложениеОбъект = Приложение.ПолучитьОбъект();
	ПриложениеОбъект.Вид = Вид;
	ПриложениеОбъект.НаименованиеВида = НаименованиеВида;
	ПриложениеОбъект.Записать();
	
КонецПроцедуры

// Определяет вид приложения по его текстовому представлению
//
// Параметры:
//   ИмяВидаПриложения - Строка - наименование конфигурации облачного приложения
//
// Возвращаемое значение:
//   Перечисление.ВидыОблачныхПриложений, Неопределено
//
Функция ВидПриложения(ИмяВидаПриложения) Экспорт
	
	ИмяВида = НРег(ИмяВидаПриложения);
	Если Найти(ИмяВида, "бухгалтерия") Тогда
		Возврат Перечисления.ВидыОблачныхПриложений.Бухгалтерия;
	ИначеЕсли Найти(ИмяВида, "зарплата") Тогда
		Возврат Перечисления.ВидыОблачныхПриложений.Зарплата;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли
